Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: She hasn’t fetched John’s changes yet, so her commit history looks like Figure 5-7.
es: Como todavia no ha recuperado los cambios de John, su historial es como se muestra en la Figura 5-7.

source: Your history no longer contains a reference to that file.
es: Tras esto, el historial ya no contiene ninguna referencia a ese archivo.

source: When other users visit this project page, they won’t see that URL—only the public one.
es: Cuando otros usuarios visiten la página del proyecto, no verán esta segunda URL --solo verán la URL pública--.

source: You should now be able to make Git fit nearly any workflow you can dream up.
es: A partir de ahora estás listo para encajar Git en prácticamente cualquier flujo de trabajo que puedas imaginar.

source: No problems occur; as you can see it, was a simple fast-forward.
es: No hay ningún problema; como puedes observar, es un simple avance rápido (fast-forward).

source: Running `git show HEAD@{2.months.ago}` will work only if you cloned the project at least two months ago — if you cloned it five minutes ago, you’ll get no results.
es: Así, un comando tal como `git show HEAD@{2.months.ago}` solo será válido en caso de haber clonado el proyecto como mínimo dos meses antes. Si se acaba de clonar hace cinco minutos, ese comando dará un resultado vacio.

source: Another cool thing about Git is that it doesn’t track file renames explicitly.
es: Otro aspecto interesante de Git es la ausencia de un seguimiento explícito de archivos renombrados.

source: There are a lot of great things about Git, but one feature that can cause issues is the fact that a `git clone` downloads the entire history of the project, including every version of every file.
es: Git tiene grandes cosas. Pero el hecho de que un `git clone` siempre descarge la historia completa del proyecto (incluyendo todas y cada una de las versiones de todos y cada uno de los archivos). Puede casusar problemas.

source: Insert 18333fig0306.png Figure 3-6.
es: Insert 18333fig0306.png Figura 3-6.

source: You accomplish that by using refspecs to push.
es: Pues utilizando las referencias (refspecs) para enviar.

source: Here we’ll discuss what they are and in what basic circumstances you would want (or not want) to use them.
es: Vamos a ver en qué consisten y las circunstancias en que querrás (o no) utilizar cada uno de ellos.

source: If you want to allow Git protocol access for your iphone project, you add this to the end of the `gitosis.conf` file:
es: Por ejemplo, si quieres permitir acceso a tu 'proyecto iphone', puedes añadir lo siguiente al archivo 'gitosis.conf':

source: You can see your reflog by using `git reflog`:
es: Este registro de referencia se puede consultar con el comando 'git reflog':

source: If you want to remove all accidentally committed editor backup files, you can run something like `git filter-branch --tree-filter 'rm -f *~' HEAD`.
es: Otro ejemplo: si se desean eliminar todos los archivos de respaldo del editor que han sido almacenados por error, se podría lanzar algo así como `git filter-branch --tree-filter 'rm -f *~' HEAD`.

source: That’s all.
es: Y eso es todo.

source: The two that are turned on by default are `trailing-space`, which looks for spaces at the end of a line, and `space-before-tab`, which looks for spaces before tabs at the beginning of a line.
es: Los dos activos por defecto son 'trailing-space' (espaciado de relleno), que vigila por si hay espacios al final de las líneas, y 'space-before-tab' (espaciado delante de un tabulador), que mira por si hay espacios al principio de las lineas o por delante de los tabuladores.

source: Now you can see how Git has stored your data:
es: En estos momentos, ya puedes comprobar la forma en que Git ha guardado tus datos:

source: If you try to switch back to a branch where those files are still in the actual tree rather than a submodule — you get this error:
es: Si se intenta retornar a dicha rama, cuyos archivos están aún en el árbol actual en lugar de en el submódulo, se obtendrá el siguiente error:

source: When you run `git submodule update`, it checks out the specific version of the project, but not within a branch.
es: Al lanzar `git submodule update`, este comando comprueba la versión específica del proyecto, pero sin tener en cuenta la rama.

source: You merged in what is basically a change to the pointer for your submodule; but it doesn’t update the code in the submodule directory, so it looks like you have a dirty state in your working directory:
es: Se ha fusionado en algo que es básicamente un cambio en el puntero al submódulo. Pero no se ha actualizado el código en la carpeta del submódulo propiamente dicha. Por lo que se muestra un estado inconsistente en la misma:

source: Here you can run `rev-parse` on your branch.
es: Por ejemplo, lanzando el comando 'rev-parse' sobre una rama, esta muestra el código SHA-1 de la última confirmación de cambios en ella:

source: After a topic branch release.
es: Tras un lanzamiento puntual.

source: Insert 18333fig0409.png Figure 4-9.
es: Insert 18333fig0409.png Figura 4-9.

source: To create a branch back at the second commit, you can do this:
es: Para crear una rama hacia la segunda confirmación de cambios, puedes hacer:

source: Feel free to give out that URL and post it on your web site or what have you.
es: Puedes comunicar libremente ese URL o puedes publicarlo en tu sitio web o en cualquier otro médio que desees.

source: #### Double Dot ####
es: #### Doble punto ####

source: This happens because Git directly compares the snapshots of the last commit of the topic branch you’re on and the snapshot of the last commit on the `master` branch.
es: Debido a que Git compara directamente las instantáneas de la última confirmación de cambios en la rama puntual donde te encuentras y en la rama 'master'.

source: You use this command to artificially add the earlier version of the test.txt file to a new staging area.
es: Este comando se utiliza para añadir artificialmente la versión anterior del archivo test.txt. a una nueva área de preparación

source: All the lieutenants have one integration manager known as the benevolent dictator.
es: Todos los tenientes rinden cuentas a un gestor de integración; conocido como el dictador benevolente.

source: This file is written by the `update-server-info` command, which is why you need to enable that as a `post-receive` hook in order for the HTTP transport to work properly:
es: Este es un archivo escrito por el comando `update-server-info`, el que has de habilitar como enganche (hook) `post-receive` para permitir funcionar correctamente al transporte HTTP:

source: Git applies the last commit (`a5f4a0d`) in the script, and your history looks like this:
es: Tras esto, Git reaplicará la última de las confirmaciones de cambios (`a5f4a0d`) en el script. Quedando la historia:

source: It’s important to note that with the exception of the HTTP protocols, all of these require Git to be installed and working on the server.
es: Merece destacar que, con la excepción del protocolo HTTP, todos los demás protocolos requieren que Git esté instalado y operativo en el servidor.

source: It’s worth pointing out that Git determines the best common ancestor to use for its merge base; this is different than CVS or Subversion (before version 1.5), where the developer doing the merge has to figure out the best merge base for themselves.
es: Merece la pena destacar el hecho de que es el propio Git quien determina automáticamente el mejor ancestro común para realizar la fusión. Diferenciandose de otros sistemas tales como CVS o Subversion, donde es el desarrollador quien ha de imaginarse cuál puede ser dicho mejor ancestro común.

source: The `--squash` option takes all the work on the merged branch and squashes it into one non-merge commit on top of the branch you’re on.
es: La opción '--squash' coge todo el trabajo en la rama fusionada y lo aplica, en una sola confirmación de cambios sin fusión (no-merge commit), sobre la rama en la que estés situado.

source: To create a new reference that will help you remember where your latest commit is, you can technically do something as simple as this:
es: Para crear una nueva referencia que te sirva de ayuda para recordar cual es tu última confirmación de cambios, puedes realizar técnicamente algo tan simple como:

source: ### RefLog Shortnames ###
es: ### Nombres cortos en RefLog ###

source: You go back to your code, and it turns out you can reproduce the issue, but you can’t figure out what is going wrong.
es: Si, volviendo atras, resulta que se consigue reproducir el problema, pero cuesta identificar su causa.

source: The master branch is that of the dictator.
es: La rama master es la del dictador benevolente.

source: The output from the command is a 40-character checksum hash.
es: La salida del comando es una suma de comprobación (checksum hash) de 40 caracteres.

source: This is a tad confusing, because now you’ve seen at least three different ways that Git uses the `^` to modify a commit SHA, but that is what it means here.
es: Puede ser un poco confuso, debido a que la marca `^` se utiliza también con otros significados diferentes dentro de Git. Pero este es el sentido en que se utiliza aquí: para señalar la confirmación de cambios original.

source: ### Splitting a Commit ###
es: ### Dividir una confirmación de cambios en varias ###

source: You can download P4Merge here:
es: P4Merge se puede descargar desde:

source: In fact, we used GitHub to privately collaborate on this book.
es: De hecho, nosotros utilizamos también GitHub para colaborar privadamente en este libro.

source: #### Enforcing a Specific Commit-Message Format ####
es: #### Obligando a utilizar un formato específico en el mensaje de confirmación de cambios ####

source: or the second version:
es: o a su segunda versión

source: Grab the tree object:
es: Y el árbol de contenido:

source: ### Formatting and Whitespace ###
es: ### Formato y espacios en blanco ###

source: Git figured out that about 12 commits came between the commit you marked as the last good commit (v1.0) and the current bad version, and it checked out the middle one for you.
es: Git averigua que se han dado 12 confirmaciones de cambio entre la confirmación marcada como buena y la marcada como mala. Y extrae la confirmación central de la serie, para comenzar las comprobaciones a partir de ahí.

source: ### The Basic Rebase ###
es: ### Reorganización básica ###

source: One of the things Git does in the background while you’re working away is keep a reflog — a log of where your HEAD and branch references have been for the last few months.
es: Una de las tareas realizadas por Git continuamente en segundo plano, mientras nosotros trabajamos, es el mantenimiento de un registro de referencia (reflog). En este registro queda traza de dónde han estado las referencias a HEAD y a las distintas ramas durante los últimos meses.

source: All you really have to do is provide a project name, but you can also add a description.
es: Es suficiente con dar un nombre al proyecto, pero también puedes añadirle una descripción.

source: ### Superprojects ###
es: ### Proyectos padre ###

source: If you want your own `serverfix` branch that you can work on, you can base it off your remote branch:
es: Y si quieres tener tu propia rama 'serverfix', donde puedas trabajar, puedes crearla directamente basandote en rama remota:

source: This is a nice shortcut to recover stashed work easily and work on it in a new branch.
es: Este es un buen atajo para recuperar con facilidad un cierto trabajo desde la pila y continuar con él en una nueva rama.

source: ### Applying Patches from E-mail ###
es: ### Aplicar parches recibidos por correo-e ###

source: Let’s get rid of it.
es: Para arreglar la situación.

source: Then, when the codebase on that branch is stable and passes tests, you merge it into a develop branch; and when that has proven itself stable for a while, you fast-forward your master branch.
es: A continuación, cuando el código en dicha rama sea estable y pase todas las pruebas, la fusionarás con la rama 'develop'; y, cuando se demuestre que permanece estable durante un cierto tiempo, avanzarás la rama 'master' hasta ahí.

source: If you need to pull it in, you can merge your `master` branch into your `iss53` branch by running `git merge master`, or you can wait to integrate those changes until you decide to pull the `iss53` branch back into `master` later.
es: Si fuera necesario agregarlos, puedes fusionar (merge) la rama 'master' sobre la rama 'iss53' utilizando el comando 'git merge master'. O puedes esperar hasta que decidas llevar (pull) la rama 'iss53' a la rama 'master'.

source: The files end up looking like this:
es: Los archivos serán algo como:

source: Even if you don’t commit during the weekend, use the staging area on Monday to split your work into at least one commit per issue, with a useful message per commit.
es: Aunque no hagas ninguna confirmación durante el fin de semana, el lunes puedes utilizar el área de preparación (staging area) para ir dividiendo tu trabajo y hacer una confirmación de cambios (commit) separada para cada asunto; con un mensaje adecuado para cada una de ellas.

source: The next line starts with 003e, which is 62, so you read the remaining 62 bytes.
es: La siguiente línea comienza con 003e, 62 en decimal, por lo que has de leer otros 62 bytes hasta el final de la linea.

source: Each line starts with a 4-byte hex value specifying how long the rest of the line is.
es: Cada linea comienza con un valor de 4 bytes, en hexadecimal, indicando la longitud del resto de la linea.

source: ### Keyword Expansion ###
es: ### Expansión de palabras clave ###

source: The project snapshot at the tip of the branch is identical whether you do one commit or five, as long as all the changes are added at some point, so try to make things easier on your fellow developers when they have to review your changes.
es: El estado del proyecto al final de cada rama será idéntico si haces una sola confirmación o si haces cinco, en tanto en cuanto todos los cambios estén confirmados en un determinado momento. Por consiguiente, intenta facilitar las cosas a tus compañeros y compañeras desarroladores cuando vayan a revisar tus cambios.

source: You’ll now look at each of these sections in detail to see how Git operates.
es: Vamos a mirar en detalle cada una de esas secciones, para ver cómo trabaja Git.

source: The other main way to specify a commit is via its ancestry.
es: Otra forma de especificar una confirmación de cambios es utilizando sus ancestros.

source: The reason is that if the work isn’t accepted or is cherry picked, you don’t have to rewind your master branch.
es: Y la razón para ello es que, si el trabajo no es aceptado o se integra solo parcialmente, no tendrás que rebobinar tu rama principal.

source: Otherwise, it will start from the beginning and will unnecessarily take longer.
es: De otro modo, el comando comenzaria desde el principio, asumiendo un proceso inecesariamente más largo.

source: For example, if you want to submit a second topic of work to the project, don’t continue working on the topic branch you just pushed up — start over from the main repository’s `master` branch:
es: Por ejemplo, si deseas contribuir al proyecto en un segundo tema, no continues trabajando sobre la rama puntual que acabas de enviar; comienza una nueva rama puntual desde la rama 'master' del repositorio principal:

source: This may mean moving in large binary files that you don’t want source controlled, auto-generating documentation, or something along those lines.
es: Entre otras cosas, puedes mover grandes archivos binarios de los que no quieras llevar control, puedes autogenerar documentación,....

source: They aren’t necessarily obvious but are helpful to know.
es: Algunos de estos modos no son precisamente obvios, pero conviene conocerlos.

source: Git automatically colors most of its output if you ask it to.
es: Si se lo pides, Git coloreará automáticamente la mayor parte de los resultados que muestre.

source: This is just the default refspec for `git fetch` for that remote.
es: Quedando así esta referencia como la referencia por defecto para el comando `git fetch` para ese remoto.

source: What if you want anonymous read access to your project?
es: ¿Qué hacer si necesitas acceso anónimo de lectura a tu proyecto?

source: If another developer makes changes to the rack code and commits, and you pull that reference down and merge it in, you get something a bit odd:
es: Si otra persona realiza cambios en el código de `rack`, los confirma y nosotros recuperamos (pull) dicha referencia y la fusionamos (merge), se obtendrá un resultado un tanto extraño:

source: It turns out that it can.
es: Pues bien, Git lo puede hacer.

source: ### Cloning a Project with Submodules ###
es: ### Clonando un proyecto con submódulos ###

source: Now, modify that file a little, and see what happens:
es: Ahora, modifica un poco dicho archivo y comprueba lo que sucede:

source: You can set it up by setting the filter attribute in your `.gitattributes` file to filter `*.c` files with the "indent" filter:
es: Puedes hacerlo poniendo los atributos adecuados en tu archivo '.gitattributes', para filtrar los archivos '*.c' a través de "indent":

source: Insert 18333fig0305.png Figure 3-5.
es: Insert 18333fig0305.png Figura 3-5.

source: It’s nice that you can fetch namespaced references that way, but how does the QA team get their branches into a `qa/` namespace in the first place?
es: Es util poder recuperar (fetch) referencias relativas en espacios de nombres, tal y como hemos visto. Pero, ¿cómo pueden enviar (push) sus ramas al espacio de nombres `qa/` los miembros de equipo QA ?.

source: When you save and exit the editor, Git rewinds to the parent of the first commit in your list, applies the first commit (`f7f3f6d`), applies the second (`310154e`), and drops you to the console.
es: Al guardar y salir en el editor, Git rebobinará la historia hasta el padre de la primera confirmación de cambios en la lista, reaplicará esa primera confirmación (`f7f3f6d`), luego reaplicará la segunda (`310154e`) y luego devolverá la línea de comandos.

source: This takes a number of custom settings: `merge.tool` to tell Git what strategy to use, `mergetool.*.cmd` to specify how to run the command, `mergetool.trustExitCode` to tell Git if the exit code of that program indicates a successful merge resolution or not, and `diff.external` to tell Git what command to run for diffs.
es: Tenemos varios parámetros a ajustar: 'merge.tool' para indicar a Git la estrategia que ha de usar, 'mergetool.*.cmd' para especificar como lanzar el comando, 'mergetool.trustExitCode' para decir a Git si el código de salida del programa indica una fusión con éxito o no, y 'diff.external' para decir a Git qué comando lanzar para realizar comparaciones.

source: It moved the HEAD pointer back to point to the master branch, and it reverted the files in your working directory back to the snapshot that master points to.
es: Mueve el apuntador HEAD de nuevo a la rama 'master', y revierte los archivos de tu carpeta de trabajo; dejandolos tal y como estaban en la última instantánea confirmada en dicha rama 'master'.

source: ### Private Small Team ###
es: ### Pequeño Grupo Privado ###

source: Again, GitWeb can be served with any CGI capable web server; if you prefer to use something else, it shouldn’t be difficult to set up.
es: Recordar una vez más que GitWeb puede servirse desde cualquier servidor web con capacidades CGI. Por lo que si prefieres utilizar algún otro, no debería ser dificil de configurarlo.

source: The logic for checking this is to see if any commits are reachable from the older revision that aren’t reachable from the newer one.
es: La lógica para hacer así la comprobación es la de mirar por si alguna confirmación de cambios se puede alcanzar desde la versión más antigua pero no desde la más reciente.

source: The reflog is also updated by the `git update-ref` command, which is another reason to use it instead of just writing the SHA value to your ref files, as we covered in the "Git References" section of this chapter earlier.
es: El registro reflog se actualiza incluso cuando utilizas el comando `git update-ref`. Siendo esta otra de las razones por las que es recomendable utilizar ese comando en lugar de escribir manualmente los valores SHA en los archivos de referencia, tal y como hemos visto anteriormente en la sección "Referencias Git".

source: However, keep in mind that to collaborate with a couple of people on a private project, all you _need_ is an SSH server and a bare repository.
es: Pero, ten presente que para colaborar con un pequeño grupo de personas en un proyecto privado, todo lo que necesitas es un servidor SSH y un repositorio básico.

source: ## Maintenance and Data Recovery ##
es: ## Mantenimiento y recuperación de datos ##

source: You can bisect the code to find out.
es: Se puede ir biseccionando el código para intentar localizar el punto del historial desde donde se presenta el problema.

source: ### The Dumb Protocol ###
es: ### El protocolo tonto (dumb) ###

source: ### Tracking Branches ###
es: ### Haciendo seguimiento a las ramas ###

source: By now, you’ve learned most of the day-to-day commands and workflows that you need to manage or maintain a Git repository for your source code control.
es: A estas alturas, hemos aprendido la mayoria de los comandos y flujos de trabajo empleados habitualmente a la hora de utilizar, gestionar y mantener un repositorio Git para el control de versiones de código fuente.

source: A good way to do this in Git is to make each of the subfolders a separate Git repository and then create superproject Git repositories that contain multiple submodules.
es: La manera más apropiada de hacer esto en Git, es la de crear diferentes repositorios, cada uno en su carpeta; para luego crear un repositorio padre que englobe múltiples submódulos, uno por cada carpeta.

source: The idea is that your branches are at various levels of stability; when they reach a more stable level, they’re merged into the branch above them.
es: La idea es mantener siempre diversas ramas en diversos grados de estabilidad; pero cuando alguna alcanza un estado más estable, la fusionamos con la rama inmediatamente superior a ella.

source: Although Git has an internal implementation of diff, which is what you’ve been using, you can set up an external tool instead.
es: Aunque Git lleva una implementación interna de diff, la que se utiliza habitualmente, se puede sustituir por una herramienta externa.

source: If it sees one that is reachable from one of your remote references, it aborts the rebase:
es: Si encuentra alguna, aborta la reorganización:

source: Finally, you ask `filter-branch` to rewrite your history only from the `6df7640` commit up, because you know that is where this problem started.
es: Y por último, se indica a `filter-branch` que reescriba la historia a partir de la confirmación de cambios `6df7640`, porque ya conocemos que es a partir de ahí donde comenzaba el problema.

source: At this point, John’s local repository looks something like Figure 5-4.
es: En este punto, el repositorio local de John será algo parecido a la Figura 5-4.

source: Rebasing replays changes from one line of work onto another in the order they were introduced, whereas merging takes the endpoints and merges them together.
es: La reorganización vuelve a aplicar cambios de una rama de trabajo sobre otra rama, en el mismo orden en que fueron introducidos en la primera. Mientras que la fusión combina entre sí los dos puntos finales de ambas ramas.
